# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_container_registry.altinncr: Reading...
data.azurerm_container_registry.altinncr: Read complete after 0s [id=/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.dis_apim_app will be created
  + resource "azuread_application" "dis_apim_app" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "admin-test-dis-apim-app"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application_federated_identity_credential.dis_apim_app_fed_identity will be created
  + resource "azuread_application_federated_identity_credential" "dis_apim_app_fed_identity" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "The federated identity used to federate K8s with Azure AD with the app service running in admin-test aks"
      + display_name   = "dis-apim-fed-identity-admin-test-aks"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/92049459-fc39-4ae6-8fed-b7baaa092379/"
      + subject        = "system:serviceaccount:dis-apim-operator-system:dis-apim-operator-controller-manager"
    }

  # azuread_service_principal.dis_apim_sp will be created
  + resource "azuread_service_principal" "dis_apim_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # kubectl_manifest.flux_cert_manager_helm_release will be created
  + resource "kubectl_manifest" "flux_cert_manager_helm_release" {
      + api_version             = "helm.toolkit.fluxcd.io/v2"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "HelmRelease"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cert-manager"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: helm.toolkit.fluxcd.io/v2
            kind: HelmRelease
            metadata:
              name: cert-manager
              namespace: cert-manager
            spec:
              chart:
                spec:
                  chart: cert-manager
                  interval: 12h
                  sourceRef:
                    kind: HelmRepository
                    name: cert-manager
                    namespace: cert-manager
                  version: 1.17.x
              interval: 30m
              values:
                installCRDs: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_cert_manager_helm_repository will be created
  + resource "kubectl_manifest" "flux_cert_manager_helm_repository" {
      + api_version             = "source.toolkit.fluxcd.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "HelmRepository"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cert-manager"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1
            kind: HelmRepository
            metadata:
              name: cert-manager
              namespace: cert-manager
            spec:
              interval: 24h
              url: https://charts.jetstack.io
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_cwert_manger_namespace will be created
  + resource "kubectl_manifest" "flux_cwert_manger_namespace" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cert-manager"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: cert-manager
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_dis_apim_dev_kustomization will be created
  + resource "kubectl_manifest" "flux_dis_apim_dev_kustomization" {
      + api_version             = "kustomize.toolkit.fluxcd.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Kustomization"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "dis-apim"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: kustomize.toolkit.fluxcd.io/v1
            kind: Kustomization
            metadata:
              name: dis-apim
              namespace: flux-system
            spec:
              images:
              - name: controller
                newName: ghcr.io/altinn/altinn-platform/dis-apim-operator
                newTag: latest
              interval: 5m
              patches:
              - patch: |-
                  - op: add
                    path: /metadata/annotations
                    value:
                      azure.workload.identity/client-id: "ddf74485-4dbf-4991-9c03-1a651290e0c9"
                target:
                  kind: ServiceAccount
                  name: controller-manager
              - patch: "- op: add
  path: /spec/template/spec/containers/0/env
  value:
    -
                  name: DISAPIM_SUBSCRIPTION_ID
      value: 1ce8e9af-c2d6-44e7-9c5e-099a308056fe

                     - name: DISAPIM_RESOURCE_GROUP
      value: "altinn-apim-test-rg"
    -
                  name: DISAPIM_APIM_SERVICE_NAME
      value: "altinn-apim-test-apim"
- op:
                  add
  path: /spec/template/metadata/labels/azure.workload.identity~1use
  value:
                  "true"    "
                target:
                  kind: Deployment
              path: ./default
              prune: true
              retryInterval: 5m
              sourceRef:
                kind: OCIRepository
                name: dis-apim
              targetNamespace: dis-apim-operator-system
              timeout: 10m
              wait: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.flux_dis_apim_ocirepo will be created
  + resource "kubectl_manifest" "flux_dis_apim_ocirepo" {
      + api_version             = "source.toolkit.fluxcd.io/v1beta2"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "OCIRepository"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "dis-apim"
      + namespace               = "flux-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: source.toolkit.fluxcd.io/v1beta2
            kind: OCIRepository
            metadata:
              name: dis-apim
              namespace: flux-system
            spec:
              interval: 5m
              provider: azure
              ref:
                tag: latest
              url: oci://altinncr.azurecr.io/ghcr.io/altinn/altinn-platform/kustomize/dis-apim-operator
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/admin-test-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/admin-test-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_admin-test-aks-rg.tfstate.tfplan`